# From SQL to pandas challenge 10

In [ ]:

# import libraries
import pandas as pd
import numpy as np

# load data
# This code is made to load our data stored on Google Drive
def gd_path(file_id):
    """Generate a shareable link from Google Drive file id."""
    return f"https://drive.google.com/uc?export=download&id={file_id}"

# Google Drive file ids
files_id = {
    "titleauthor": "1F1JOiYXStWacOBca6coNVfyVtoST7ZgD",
    "titles": "1PLdn50N9GRa53ZbuVWo0l47F_IXdvlEm",
    "stores": "1f-GCgip7O93CpbAkYvOsc21eKnSOSHsQ", 
    "sales": "1fzFc9rwYmVIPaGOFmhLVxCi3kg19vNU2", 
    "roysched": "1zPRZPoFPEMKyrNR5VSENeYFHGCBZmxbs", 
    "publishers": "1s9E8_AVOziTrowb3wyh2jg3PV763VOyq",
    "pub_info": "1OEgogcGKy--EpuVj0kqq7lyBZNGW6YSv", 
    "jobs": "1V1Za8hUdXD-vJOyRdX4aQV5wanIff2eM", 
    "employee": "1h9mUjsVqpP74b1w0x7KOw37n_n9Ulkt5", 
    "discounts": "111dvSxMcCsTgOuV1wDSKFJxO1Xcxd9VS", 
    "authors": "1fEF89Nhe61EebAljKlwFwfEuokK0o6aJ"
}

# Read data from Google Drive
sales = pd.read_csv(gd_path(files_id["sales"]), sep=";")
titles = pd.read_csv(gd_path(files_id["titles"]), sep=";")

## 1. Select everything from the sales table and create a new column called "sales_category" to categorise qty:
   
		qty >= 50 high sales
		20 <= qty < 50 medium sales
		qty < 20 low sales

In [ ]:
sales.loc[sales["qty"] >= 50, "sales_category"] = "high sales"
sales.loc[(sales["qty"] >= 20, "sales_category") and (sales["qty"] < 50, "sales_category")] = "medium sales"
sales.loc[sales["qty"] < 20, "sales_category"] = "low sales"
sales

,stor_id,ord_num,ord_date,qty,payterms,title_id,sales_category
0,6380,6871,1994-09-14 00:00:00,5,Net 60,BU1032,low sales
1,6380,722a,1994-09-13 00:00:00,3,Net 60,PS2091,low sales
2,7066,A2976,1993-05-24 00:00:00,50,Net 30,PC8888,high sales
3,7066,QA7442.3,1994-09-13 00:00:00,75,ON invoice,PS2091,high sales
4,7067,D4482,1994-09-14 00:00:00,10,Net 60,PS2091,low sales
5,7067,P2121,1992-06-15 00:00:00,40,Net 30,TC3218,medium sales
6,7067,P2121,1992-06-15 00:00:00,20,Net 30,TC4203,medium sales
7,7067,P2121,1992-06-15 00:00:00,20,Net 30,TC7777,medium sales
8,7131,N914008,1994-09-14 00:00:00,20,Net 30,PS2091,medium sales
9,7131,N914014,1994-09-14 00:00:00,25,Net 30,MC3021,medium sales
10,7131,P3087a,1993-05-29 00:00:00,20,Net 60,PS1372,medium sales
11,7131,P3087a,1993-05-29 00:00:00,25,Net 60,PS2106,medium sales
12,7131,P3087a,1993-05-29 00:00:00,15,Net 60,PS3333,low sales
13,7131,P3087a,1993-05-29 00:00:00,25,Net 60,PS7777,medium sales
14,7896,QQ2299,1993-10-28 00:00:00,15,Net 60,BU7832,low sales
15,7896,TQ456,1993-12-12 00:00:00,10,Net 60,MC2222,low sales
16,7896,X999,1993-02-21 00:00:00,35,ON invoice,BU2075,medium sales
17,8042,423LL922,1994-09-14 00:00:00,15,ON invoice,MC3021,low sales
18,8042,423LL930,1994-09-14 00:00:00,10,ON invoice,BU1032,low sales
19,8042,P723,1993-03-11 00:00:00,25,Net 30,BU1111,medium sales
20,8042,QA879.1,1993-05-22 00:00:00,30,Net 30,PC1035,medium sales

In [ ]:
sales['sales_category'] = (
    np.where(sales['qty'] >= 50, 'high sales',
    np.where(sales['qty'] >= 20, 'medium sales',
    'low sales'))
)

print(sales)

    stor_id   ord_num             ord_date  qty    payterms title_id  \
0      6380      6871  1994-09-14 00:00:00    5      Net 60   BU1032
1      6380      722a  1994-09-13 00:00:00    3      Net 60   PS2091
2      7066     A2976  1993-05-24 00:00:00   50      Net 30   PC8888
3      7066  QA7442.3  1994-09-13 00:00:00   75  ON invoice   PS2091
4      7067     D4482  1994-09-14 00:00:00   10      Net 60   PS2091
5      7067     P2121  1992-06-15 00:00:00   40      Net 30   TC3218
6      7067     P2121  1992-06-15 00:00:00   20      Net 30   TC4203
7      7067     P2121  1992-06-15 00:00:00   20      Net 30   TC7777
8      7131   N914008  1994-09-14 00:00:00   20      Net 30   PS2091
9      7131   N914014  1994-09-14 00:00:00   25      Net 30   MC3021
10     7131    P3087a  1993-05-29 00:00:00   20      Net 60   PS1372
11     7131    P3087a  1993-05-29 00:00:00   25      Net 60   PS2106
12     7131    P3087a  1993-05-29 00:00:00   15      Net 60   PS3333
13     7131    P3087a  1993-05-29 00:00:00   25      Net 60   PS7777
14     7896    QQ2299  1993-10-28 00:00:00   15      Net 60   BU7832
15     7896     TQ456  1993-12-12 00:00:00   10      Net 60   MC2222
16     7896      X999  1993-02-21 00:00:00   35  ON invoice   BU2075
17     8042  423LL922  1994-09-14 00:00:00   15  ON invoice   MC3021
18     8042  423LL930  1994-09-14 00:00:00   10  ON invoice   BU1032
19     8042      P723  1993-03-11 00:00:00   25      Net 30   BU1111
20     8042   QA879.1  1993-05-22 00:00:00   30      Net 30   PC1035

   sales_category
0       low sales
1       low sales
2      high sales
3      high sales
4       low sales
5    medium sales
6    medium sales
7    medium sales
8    medium sales
9    medium sales
10   medium sales
11   medium sales
12      low sales
13   medium sales
14      low sales
15      low sales
16   medium sales
17      low sales
18      low sales
19   medium sales
20   medium sales

### Hint:

In SQL the syntax is:

```sql
SELECT *,
CASE
    WHEN qty >= 50 THEN "high sales"
    WHEN qty >= 20 THEN "medium sales"
    ELSE "low sales"
END AS sales_category
FROM sales;
```

## 2. Adding to your answer from the previous question. Find out the total amount of books sold (qty) in each sales category 
    i.e. How many books had high sales, how many had medium sales, and how many had low sales

In [ ]:
(
sales 
    .groupby(by = 'sales_category')
    .aggregate({'qty': 'sum'})
)

                qty
sales_category
high sales      125
low sales        83
medium sales    285

### Hint:

In SQL the syntax is:

```sql
SELECT sum(qty),
CASE
	WHEN qty>=50 THEN 'high sales'
    WHEN (qty>=20 AND qty<50) THEN 'medium sales'
    ELSE 'low sales'
END AS sales_category
FROM sales
GROUP BY sales_category;
```

## 3. Adding to your answer from the previous questions: output only those sales categories that have a SUM(qty) greater than 100, and order them in descending order

In [ ]:
books_per_category = (
sales 
    .groupby(by = 'sales_category')
    .aggregate({'qty': 'sum'})
)

(
books_per_category
    .loc[books_per_category['qty']>100]
    .sort_values(by = 'qty', ascending = False)
)

                qty
sales_category
medium sales    285
high sales      125

### Hint:

In SQL the syntax is:

```sql
SELECT sum(qty),
CASE
    WHEN qty>=50 THEN 'high sales'
    WHEN (qty>=20 AND qty<50) THEN 'medium sales'
    ELSE 'low sales'
END AS sales_category
FROM sales
GROUP BY sales_category
HAVING sum(qty)>100
ORDER BY sum(qty) DESC;
```

## 4. Find out the average book price, per publisher, for the following book types and price categories:
		book types: business, traditional cook and psychology
		price categories: <= 5 super low, <= 10 low, <= 15 medium, > 15 high
        
        - When displaying the average prices, use ROUND() to hide decimals.

In [ ]:

selected_books = titles.loc[titles["type"].isin(['business', 'trad_cook', 'psychology'])].copy()

selected_books['price_category']= (
    np.where(selected_books['price']<=5, 'super low',
    np.where(selected_books['price'] <=10,'low',
    np.where(selected_books['price'] <=15, 'medium',
    'high')))
)

average_category_price = (
selected_books
    .groupby(by = ['pub_id', 'type', 'price_category'])
    .aggregate({'price': 'mean'})
)

average_category_price['price'] = round(average_category_price['price'], 2)

print(average_category_price)

                                  price
pub_id type       price_category
736    business   super low        2.99
       psychology high            19.99
                  low              7.50
                  medium          10.95
877    psychology high            21.59
       trad_cook  high            20.95
                  medium          13.47
1389   business   high            19.99
                  medium          11.95

### Hint:

In SQL the syntax is:

```sql
SELECT
    ROUND(AVG(price)),
    type,
    pub_name,
CASE
    WHEN price <= 5 THEN 'super low'
    WHEN (price > 5 AND price <= 10) THEN 'low'
    WHEN (price > 10 AND price <= 15) THEN 'medium'
    ELSE 'high'
END AS price_category
FROM titles
LEFT JOIN publishers
ON titles.pub_id=publishers.pub_id
GROUP BY
    pub_name,
    type,
    price_category
HAVING
    type IN ('business', 'trad_cook', 'psychology');
```